Revit 2026 API

# WireConduitType Class

---

Represents a specific conduit type of wire type.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireConduitType

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WireConduitType : APIObject
```
```vb
Public Class WireConduitType
	Inherits APIObject
```
```cpp
public ref class WireConduitType : public APIObject
```
```fsharp
type WireConduitType =
    class
        inherit APIObject
    end
```

The WireConduitType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Name |  |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace